china-djyos/djyos/bsp/cpudrv/stm32/f3/src/uart/cpu_peri_uart.c
#define CFG_UART5_SENDBUF_LEN            32                 //"UART5发送环形缓冲区大小",
#define CFG_UART5_RECVBUF_LEN            32                 //"UART5接收环形缓冲区大小",
#define CFG_UART5_DMABUF_LEN             32                 //"UART5 DMA缓冲区大小",
//%$#@enum,true,false,
#define CFG_UART1_MODE                   1       			//"UART1模式",CN_UART_POLL or CN_UART_GENERAL
#define CFG_UART2_MODE                   1       			//"UART2模式",CN_UART_POLL or CN_UART_GENERAL
#define CFG_UART3_MODE                   1       			//"UART3模式",CN_UART_POLL or CN_UART_GENERAL
#define CFG_UART4_MODE                   1       			//"UART4模式",CN_UART_POLL or CN_UART_GENERAL
#define CFG_UART5_MODE                   1       			//"UART5模式",CN_UART_POLL or CN_UART_GENERAL
//%$#@enum,true,false,
#define CFG_UART1_ENABLE                 true               //"是否配置使用UART1",
#define CFG_UART2_ENABLE                 false              //"是否配置使用UART2",
#define CFG_UART3_ENABLE                 false              //"是否配置使用UART3",
#define CFG_UART4_ENABLE                 false              //"是否配置使用UART4",
#define CFG_UART5_ENABLE                 false              //"是否配置使用UART5",

//%$#@string,1,10,
//%$#select,        ***定义无值的宏，仅用于第三方组件
//%$#@free,
//%$#@end configue  ****参数配置结束
//@#$%component end configure
// =============================================================================

extern void Board_UartHalfDuplexSend(u8 SerialNo);
extern void Board_UartHalfDuplexRecv(u8 SerialNo);


// =============================================================================
#define CN_UART1_BASE USART1_BASE
#define CN_UART2_BASE USART2_BASE
#define CN_UART3_BASE USART3_BASE
#define CN_UART4_BASE UART4_BASE
#define CN_UART5_BASE UART5_BASE


static u32 TxByteTime;                    //正常发送一个字节所需要的时间
static tagUartReg *PutStrDirectReg;       //用于printk发送的串口寄存器
static tagUartReg *GetCharDirectReg;      //用于直接接收的串口寄存器
static u32 TxDirectPort;                  //用于printk发送的串口号
static u32 RxDirectPort;                  //用于直接接收的串口号
// =============================================================================
static tagUartReg volatile * const tg_UART_Reg[] = {(tagUartReg *)CN_UART1_BASE,
                                                    (tagUartReg *)CN_UART2_BASE,
                                                    (tagUartReg *)CN_UART3_BASE,
                                                    (tagUartReg *)CN_UART4_BASE,
                                                    (tagUartReg *)CN_UART5_BASE,
                                                    };
#define CN_DMA_UNUSED   0
#define CN_DMA_USED     1

// UART对应的DMA Channel中断号,F3没有Stream中断
static u8 const UartDmaRxInt[] = {CN_INT_LINE_DMA1_Channel5,CN_INT_LINE_DMA1_Channel6,
                                  CN_INT_LINE_DMA1_Channel3,CN_INT_LINE_DMA2_Channel3,
                                  };

static u8 const UartDmaTxInt[] = {CN_INT_LINE_DMA1_Channel4,CN_INT_LINE_DMA1_Channel7,
                                  CN_INT_LINE_DMA1_Channel2,CN_INT_LINE_DMA2_Channel5,
                                 };

static DMA_Channel_TypeDef * const UartDmaRxChannel[] =
                                 {DMA1_Channel5,DMA1_Channel6,
                                 DMA1_Channel3,DMA2_Channel3,};

static DMA_Channel_TypeDef * const UartDmaTxChannel[] =
                                 {DMA1_Channel4,DMA1_Channel7,
                                  DMA1_Channel2,DMA2_Channel5,};

// DMA正在使用标记，是否使用DMA标记,F3 DMA 没有UART5
static bool_t s_UART_DmaSending[] = {false,false,false,false};
static bool_t s_UART_DmaUsed[]    = {false,false,false,false};

//默认DMA缓冲区Poll模式将会重新设置这几个变量
static u32 UART1_DmaBufLen = CFG_UART1_DMABUF_LEN;
static u32 UART2_DmaBufLen = CFG_UART2_DMABUF_LEN;
static u32 UART3_DmaBufLen = CFG_UART3_DMABUF_LEN;
static u32 UART4_DmaBufLen = CFG_UART4_DMABUF_LEN;
static u32 UART5_DmaBufLen = CFG_UART5_DMABUF_LEN;

static u8 *pUART_DmaSendBuf[CN_UART_NUM];
static u8 *pUART_DmaRecvBuf[CN_UART_NUM]={NULL,NULL,NULL,NULL};

struct DivPollCB
{
    u8 *DmaRecvBuf[5];
    u32 RcvBufLen[5]; //缓冲区有效数据长度
    u8 NowRecvbuf;    //当前使用的缓冲区
    u8 NoCopyBufNum;//未拷贝缓冲区数量
} *pUartPollCB[CN_UART_NUM];

static u8 UART_Mode[CN_UART_NUM];
static struct UartGeneralCB *pUartCB[CN_UART_NUM];

//用于标识串口是否初始化标记，第0位表示UART0，第一位表UART1....
//依此类推，1表示初始化，0表示未初始化
static u8 sUartInited = 0;

// =============================================================================
static ptu32_t UART_ISR(ptu32_t port);
static uint32_t UART_DmaRx_ISR(ptu32_t port);
static uint32_t UART_DmaTx_ISR(ptu32_t port);
uint32_t UART_Poll_DmaTx_ISR(ptu32_t port);
uint32_t UART_Poll_DmaRx_ISR(ptu32_t port);
// =============================================================================
// 功能: 禁止uart的接收中断。
// 参数: flag,是否使用dma传输
//       port,串口号，1~8
// 返回: 无
// =============================================================================
void __UART_RxIntEnable(u8 flag,u8 port)
{
    if(flag == CN_DMA_USED)
        Int_RestoreAsynLine(UartDmaRxInt[port]);
    else
        tg_UART_Reg[port]->CR1 |= (1<<5);//中断使能
}

// =============================================================================
// 功能: 禁止uart的接收中断
// 参数: reg,被操作的寄存器组指针
//       port,串口号
// 返回: 无
// =============================================================================
void __UART_RxIntDisable(u8 flag, u8 port)
{
    if(flag == CN_DMA_USED)
        Int_SaveAsynLine(UartDmaRxInt[port]);
    else
        tg_UART_Reg[port]->CR1 &= ~(1<<5);
}

// =============================================================================
// 功能: 使能uart的发送中断
// 参数: reg,被操作的寄存器组指针
//       port,串口号
// 返回: 无
// =============================================================================
static void __UART_TxIntEnable(u8 flag,u8 port)
{
    if(flag == CN_DMA_USED)
        Int_RestoreAsynLine(UartDmaTxInt[port]);
    else
        tg_UART_Reg[port]->CR1 |= (1<<7);
}

// =============================================================================
// 功能: 禁止UART的发送中断
// 参数: Reg,被操作的寄存器组指针
//       port,串口号
// 返回: 无
// =============================================================================
static void __UART_TxIntDisable(u8 flag, u8 port)
{
    if(flag == CN_DMA_USED)
        Int_SaveAsynLine(UartDmaTxInt[port]);
    else
        tg_UART_Reg[port]->CR1 &= ~(1<<7);//禁止发送空中断
}

