china-djyos/djyos/bsp/cpudrv/stm32/f3/src/uart/cpu_peri_uart.c
}

// =============================================================================
// 功能: 使串口停止工作，包括时钟和uart模块
// 参数: port,串口号
// 返回: 无
// =============================================================================
void __UART_Disable(u32 port)
{
    switch(port)
    {
        case CN_UART1:  RCC->APB2ENR &=~(1<<14);  break;
        case CN_UART2:  RCC->APB1ENR &=~(1<<17); break;
        case CN_UART3:  RCC->APB1ENR &=~(1<<18); break;
        case CN_UART4:  RCC->APB1ENR &=~(1<<19); break;
        case CN_UART5:  RCC->APB1ENR &=~(1<<20); break;
        default:break;
    }
    tg_UART_Reg[port]->CR1 &= ~(1);
}

// =============================================================================
// 功能: 初始化UART对应的中断线，并初始化中断入口函数
// 参数：SerialNo,串口号
// 返回: 无
// =============================================================================
static void __UART_IntInit(u32 SerialNo)
{
    u8 IntLine;
    switch (SerialNo)
    {
        case CN_UART1:
                    IntLine = CN_INT_LINE_USART1;break;
        case CN_UART2:
                    IntLine = CN_INT_LINE_USART2;break;
        case CN_UART3:
                    IntLine = CN_INT_LINE_USART3;break;
        case CN_UART4:
                    IntLine = CN_INT_LINE_UART4; break;
        case CN_UART5:
                    IntLine = CN_INT_LINE_UART5; break;
                default:
                    return;
    }
    Int_Register(IntLine);
    Int_SetClearType(IntLine,CN_INT_CLEAR_AUTO);
    Int_IsrConnect(IntLine,UART_ISR);
    Int_SettoAsynSignal(IntLine);
//    Int_SettoReal(IntLine);
    Int_ClearLine(IntLine);
    Int_SetIsrPara(IntLine,SerialNo);
    Int_RestoreAsynLine(IntLine);
    Int_SetIsrPara(IntLine,SerialNo);   //todo:严滔检查这句是否需要
}

// =============================================================================
// 功能: 硬件参数配置和寄存器的初始化，包括波特率、停止位、校验位、数据位，默认情况下:
//       波特率:115200  ； 停止位:1 ; 校验:无 ; 数据位:8bit
// 参数: SerialNo,串口号，0~3
// 返回: 无
// =============================================================================
static void __UART_HardInit(u8 SerialNo)
{
    if(SerialNo > CN_UART_NUM)
        return;
    __UART_GpioConfig(SerialNo);  //时钟使能
   //系统初始化时已经使中断处于禁止状态，无需再禁止和清除中断。
   //初始化uart硬件控制数据结构
    tg_UART_Reg[SerialNo]->CR1 = 0;
    tg_UART_Reg[SerialNo]->CR3 |= (1<<14);
    tg_UART_Reg[SerialNo]->CR1 = 0x802d;
    tg_UART_Reg[SerialNo]->CR2 = 0x0;
    tg_UART_Reg[SerialNo]->CR3 = 0x0000;
    __UART_BaudSet(tg_UART_Reg[SerialNo],SerialNo,115200);
    Djy_DelayUs(100);//
    tg_UART_Reg[SerialNo]->ICR|=(1<<4);
    Board_UartHalfDuplexRecv(SerialNo);
}

// =============================================================================
// 功能: 查询等待串口发送完毕，超时返回
// 参数: sending，dma发送方式，串口是否已经发送完成
// 返回: 无
// =============================================================================
bool_t __uart_dma_timeout(bool_t sending)
{
    u32 timeout = 1000;
    while((sending == true)&& (timeout > 0))//超时
    {
        timeout--;
        Djy_DelayUs(1);
    }
    if(timeout == 0)
        return true;
    else
        return false;
}
// =============================================================================
// 功能: 启动串口DMA发送，使用DMA启动，在发送前需判断上次DMA是否已经发送完成，通过
//       查看标志UARTx_DMA_SENDING来判断UARTx是否已经发送完成
// 参数: PORT,串口号.
// 返回: 发送的个数
// =============================================================================
u32 __UART_DMA_SendStart(u32 port)     //uart5没有对应DMA
{
    u32 num,addr;
    u8 *DmaSendBuf;
    u32 DmaSendBufLen;

    switch(port)
    {
        case CN_UART1:
            DmaSendBufLen = UART1_DmaBufLen; break;
        case CN_UART2:
            DmaSendBufLen = UART2_DmaBufLen; break;
        case CN_UART3:
            DmaSendBufLen = UART3_DmaBufLen; break;
        case CN_UART4:
            DmaSendBufLen = UART4_DmaBufLen; break;
        case CN_UART5:
            DmaSendBufLen = UART5_DmaBufLen; break;
         default:   break;
    }

    DmaSendBuf = pUART_DmaSendBuf[port];
//    if(true == __uart_dma_timeout(s_UART_DmaSending[port]))
	if(true ==s_UART_DmaSending[port])
        return 0;
    num = UART_PortRead(pUartCB[port],DmaSendBuf,DmaSendBufLen);
    addr = (u32)DmaSendBuf;

    if(num > 0)
    {
        DMA_Enable(UartDmaTxChannel[port],addr,num); //启动DMA
        s_UART_DmaSending[port] = true;
    }
    else
    {
        tg_UART_Reg[port]->CR1 |= (1<<6);
    }
    return 0;
}

// =============================================================================
// 功能: 启动串口发送，其目的是触发中断，用中断方式发送数据。
// 参数: Reg,被操作的串口寄存器指针.
// 返回: 发送的个数
// =============================================================================
static u32 __UART_SendStart (tagUartReg *Reg,u32 timeout)
{
    u8 port;

    switch((u32)Reg)
    {
        case CN_UART1_BASE:        port = CN_UART1;    break;
        case CN_UART2_BASE:        port = CN_UART2;    break;
        case CN_UART3_BASE:        port = CN_UART3;    break;
        case CN_UART4_BASE:        port = CN_UART4;    break;
        case CN_UART5_BASE:        port = CN_UART5;    break;
        default:return 0;
    }
    Reg->CR1 &=~(1<<6);
    Board_UartHalfDuplexSend(port);//切换到发送
    __UART_TxIntDisable(s_UART_DmaUsed[port],port);
    if(s_UART_DmaUsed[port])
    {
        __UART_DMA_SendStart(port);
    }
    else
    {
        //非DMA方式，只要使能发送空中断，则触发中断
    }

    __UART_TxIntEnable(s_UART_DmaUsed[port],port);
    return 1;
}

// =============================================================================
// 功能: 设置uart使用dma收发，根据stm32各串口的收发dma通道配置寄存器。将重新初
//       始化所有dma寄存器，因为:
//       1、不使用dma期间可能有其他设备使用dma，从而更改了设置。
//       2、即使uart使用dma期间，也可能软件模块配合的问题导致其他设备使用dma.
// 参数: port,端口号，即串口号，从1~3
// 返回: 无
// =============================================================================
void __UART_SetDmaUsed(u32 port)
{
    u8 *DmaRecvBuf,*DmaSendBuf;
    u32 DmaBufLen;
    switch(port)
    {
    case CN_UART1:
        DmaBufLen = UART1_DmaBufLen;   break;
    case CN_UART2:
        DmaBufLen = UART2_DmaBufLen;   break;
    case CN_UART3:
        DmaBufLen = UART3_DmaBufLen;   break;
    case CN_UART4:
        DmaBufLen = UART4_DmaBufLen;   break;
    case CN_UART5:
        DmaBufLen = UART5_DmaBufLen;   break;
    default :        break;
    }

    if(pUART_DmaRecvBuf[port]==NULL)  //分配内存
    {
        pUART_DmaRecvBuf[port] = (u8*)M_Malloc(DmaBufLen,0);
        if(pUART_DmaRecvBuf[port] == NULL)
            goto exit_from_Rcvbuf;
    }
    if(pUART_DmaSendBuf[port]==NULL)
    {
        pUART_DmaSendBuf[port] = (u8*)M_Malloc(DmaBufLen,0);
        if(pUART_DmaSendBuf[port] == NULL)
            goto exit_from_Sendbuf;
    }
    if(UART_Mode[port] == CN_UART_POLL)
    {
        if(pUartPollCB[port]==NULL)
        {
            pUartPollCB[port]= (struct DivPollCB *)M_Malloc(sizeof( struct DivPollCB),0);
            if(pUartPollCB[port]==NULL)
                goto exit_from_Poll;
            memset(pUartPollCB[port],0x00,sizeof(struct DivPollCB));
        }
        pUartPollCB[port]->DmaRecvBuf[0]=pUART_DmaRecvBuf[port];

        if(pUartPollCB[port]->DmaRecvBuf[1]==NULL)
        {
            pUartPollCB[port]->DmaRecvBuf[1] = (u8*)M_Malloc(DmaBufLen,0);
            if(pUartPollCB[port]->DmaRecvBuf[1] == NULL)
                goto exit_from_Rcvbuf2;
        }
        if(pUartPollCB[port]->DmaRecvBuf[2]==NULL)
        {
            pUartPollCB[port]->DmaRecvBuf[2] = (u8*)M_Malloc(DmaBufLen,0);
            if(pUartPollCB[port]->DmaRecvBuf[2] == NULL)
                goto exit_from_Rcvbuf2;
        }
        if(pUartPollCB[port]->DmaRecvBuf[3]==NULL)
        {
            pUartPollCB[port]->DmaRecvBuf[3] = (u8*)M_Malloc(DmaBufLen,0);
            if(pUartPollCB[port]->DmaRecvBuf[3] == NULL)
                goto exit_from_Rcvbuf2;
        }
        if(pUartPollCB[port]->DmaRecvBuf[4]==NULL)
        {
           pUartPollCB[port]->DmaRecvBuf[4] = (u8*)M_Malloc(DmaBufLen,0);
           if(pUartPollCB[port]->DmaRecvBuf[4] == NULL)
               goto exit_from_Rcvbuf2;
        }
        pUartPollCB[port]->NowRecvbuf = 0;
        pUartPollCB[port]->NoCopyBufNum = 0;
        free(pUART_DmaSendBuf[port]); //poll模式发送缓冲区会在发送时定位到应用层的数据缓冲区
    }

    DmaRecvBuf = pUART_DmaRecvBuf[port];
    DmaSendBuf = pUART_DmaSendBuf[port];
    __UART_RxIntDisable(CN_DMA_UNUSED,port); //串口中断失能
    __UART_TxIntDisable(CN_DMA_UNUSED,port);
    tg_UART_Reg[port]->CR1 |= (1<<4);        //使能IDLE中断

    DMA_Config(UartDmaRxChannel[port],(u32)&(tg_UART_Reg[port]->RDR),  //DMA配置
            (u32)DmaRecvBuf,DMA_DIR_P2M,DMA_DATABITS_8,DMA_DATABITS_8,DmaBufLen);

    DMA_Config(UartDmaTxChannel[port],(u32)&(tg_UART_Reg[port]->TDR),
            (u32)DmaSendBuf,DMA_DIR_M2P,DMA_DATABITS_8,DMA_DATABITS_8,DmaBufLen);

